api/app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("upc_description_id", "serial_num", "location") VALUES ($1, $2, $3) RETURNING "id"  [["upc_description_id", 51071851757], ["serial_num", 1], ["location", "in_store"]]

  def update
    @product = Product.find(params[:id])

    if @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 980190962]]
UPDATE "products" SET "location" = $1 WHERE "products"."id" = $2  [["location", "display"], ["id", 980190962]]