api/app/controllers/upc_descriptions_controller.rb

  def index
    @upc_descriptions = UpcDescription.all
---
SELECT "upc_descriptions".* FROM "upc_descriptions"

  def create
    @upc_description = UpcDescription.new(upc_description_params)

    if @upc_description.save
---
INSERT INTO "upc_descriptions" ("upc", "vendor", "sizeof", "fit", "style", "color", "gender") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["upc", 51071851757], ["vendor", "me"], ["sizeof", "32/30"], ["fit", "classic"], ["style", "shorts"], ["color", "red"], ["gender", "women"]]

  def update
    @upc_description = UpcDescription.find(params[:id])

    if @upc_description.update(upc_description_params)
---
SELECT  "upc_descriptions".* FROM "upc_descriptions" WHERE "upc_descriptions"."id" = $1 LIMIT 1  [["id", 980190962]]
UPDATE "upc_descriptions" SET "color" = $1 WHERE "upc_descriptions"."id" = $2  [["color", "green"], ["id", 980190962]]

  def destroy
    @upc_description.destroy
---
DELETE FROM "upc_descriptions" WHERE "upc_descriptions"."id" = $1  [["id", 980190962]]

    def set_upc_description
      @upc_description = UpcDescription.find(params[:id])
---
SELECT  "upc_descriptions".* FROM "upc_descriptions" WHERE "upc_descriptions"."id" = $1 LIMIT 1  [["id", 980190962]]